def バイナリサーチ(リスト, 探す値):
    最小の位置 = 0                      # 調べる範囲の最小の位置
    最大の位置 = len(リスト)-1           # リストの項目数が9なら「最大の位置」は8
    while 最小の位置 <= 最大の位置:      # 最小の位置が「最大の位置」以下である間
        真ん中の位置 = (最小の位置 + 最大の位置) // 2 # // で整数の商を得る
        候補 = リスト[真ん中の位置]       # 真ん中の位置にあるデータ
        if 候補 == 探す値:              # 当たりだったら
            return  真ん中の位置
        elif 候補 > 探す値:             # 探す値よりも候補が大きすぎた
             最大の位置=真ん中の位置-1 # 次は下半分を探すことにする
        else:                        # 探す値よりも候補が小さすぎた
             最小の位置=真ん中の位置+1
    return 'ありません'                # 見つからなかった orz

リスト = [12,21,31,46,53,69,74,88,92]         

print(バイナリサーチ(リスト,88)) # 7が出力されるはず
print(バイナリサーチ(リスト,-5)) # 「ありません」が出力されるはず